ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/FSI_TX_FSI_TX_CFG_50280000h.xml
		<bitfield id="PING_TRIGGERED" width="1" begin="3" end="3" resetval="0x0" description="Ping Frame Triggered Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0.  Note: This bit may not always be cleared when Writing to the corresponding TX_EVT_CLR bit. If PING_TIMEOUT MODE is configured to be 0, a hardware ping timeout may occur when another frame is actively being transmitted. In this case, if this bit still shows as 1 after the clear bit is written then the ping frame has been triggered but not serviced. This bit does not indicate that the ping frame has been completely sent, only that it has been triggered by the timeout event." range="3" rwaccess="W"/>
	<bitfield id="BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Buffer Overrun Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="2" rwaccess="W"/>
	<bitfield id="BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Buffer Underrun Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="1" rwaccess="W"/>
	<bitfield id="FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Frame Done Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="0" rwaccess="W"/>
	</register><register id="FSI_TX_CFG_TX_EVT_FRC" acronym="FSI_TX_CFG_TX_EVT_FRC" offset="46" width="16" description="Transmit event and error flag force register.">
		<bitfield id="PING_TRIGGERED" width="1" begin="3" end="3" resetval="0x0" description="Ping Frame Triggered Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Force the corresponding flag bit in the TX_EVT_STS Register." range="3" rwaccess="W"/>
	<bitfield id="BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Buffer Overrun Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[R/W] = Writing a 0 to this bit will have no effect. 1h[R/W] = Force the corresponding flag bit in the TX_EVT_STS Register." range="2" rwaccess="W"/>
	<bitfield id="BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Buffer Underrun Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Force the corresponding flag bit in the TX_EVT_STS Register." range="1" rwaccess="W"/>
	<bitfield id="FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Frame Done Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Force the corresponding flag bit in the TX_EVT_STS Register." range="0" rwaccess="W"/>
	</register><register id="FSI_TX_CFG_TX_USER_CRC" acronym="FSI_TX_CFG_TX_USER_CRC" offset="48" width="16" description="Transmit user-defined CRC register.">
		<bitfield id="USER_CRC" width="8" begin="7" end="0" resetval="0x0" description="User-defined CRC This register contains the 8-bit CRC value to be transmitted in the next frame if the transmission is set for  user-defined CRC option [TX_OPER_CTRL_LO.SW_CRC = 1]. This register is ignored if the hardware CRC generation is enabled." range="7:0" rwaccess="R/W"/>
	</register><register id="FSI_TX_CFG_TX_ECC_DATA" acronym="FSI_TX_CFG_TX_ECC_DATA" offset="64" width="32" description="Transmit ECC data register.">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31:16" rwaccess="R/W"/>
	<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15:0" rwaccess="R/W"/>
	</register><register id="FSI_TX_CFG_TX_ECC_VAL" acronym="FSI_TX_CFG_TX_ECC_VAL" offset="68" width="16" description="Transmit ECC value register.">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x12" description="Computed ECC Value This field contains the ECC value computed using SEC-DED either for 16-bit or 32-bit data in the TX_ECC_DATA register." range="6:0" rwaccess="R"/>
	</register><register id="FSI_TX_CFG_TX_DLYLINE_CTRL" acronym="FSI_TX_CFG_TX_DLYLINE_CTRL" offset="72" width="16" description="Transmit delay Line control register.">
		<bitfield id="TXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for TXD1 This bitfield selects the number of delay elements inserted into the TXD1 path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the TXD1 path. TXD1 is taken directly from the pin. 1h[R/W] One delay element is included in the TXD1 path. 2h[R/W] Two delay elements are included in the TXD1 path. ... 1Fh [R/W] 31 delay elements are included in the TXD1 path, the maximum." range="14:10" rwaccess="R/W"/>
	<bitfield id="TXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for TXD0 This bitfield selects the number of delay elements inserted into the TXD0 path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the TXD0 path. TXD0 is taken directly from the pin. 1h[R/W] One delay element is included in the TXD0 path. 2h[R/W] Two delay elements are included in the TXD0 path. ... 1Fh [R/W] 31 delay elements are included in the TXD0 path, the maximum." range="9:5" rwaccess="R/W"/>
	<bitfield id="TXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for TXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the TXCLK path. TXCLK is taken directly from the pin. 1h[R/W] One delay element is included in the TXCLK path. 2h[R/W] Two delay elements are included in the TXCLK path. ... 1Fh [R/W] 31 delay elements are included in the TXCLK path, the maximum." range="4:0" rwaccess="R/W"/>
	</register><register id="FSI_TX_CFG_TX_BUF_BASE_j" acronym="FSI_TX_CFG_TX_BUF_BASE_j" offset="128" width="16" description="Base address for transmit buffer.">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Transmit Data Buffer Base Address This is the base address of the 16-word data buffer used by the transmitter." range="15:0" rwaccess="R/W"/>
	</register>
</module>